app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Created Title"], ["description", "Created Description"], ["created_at", 2016-05-18 02:23:11 UTC], ["updated_at", 2016-05-18 02:23:11 UTC]]
---
  def create
    @post = Post.create(params.permit(:title, :description))

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 298486374], ["LIMIT", 1]]
---
  def find_post
    -> (params) {
      @post ||= Post.find(params[:id])